{"id":"377587e0-d9ff-11ec-962f-a3a018b7d10f","updated_at":"2022-05-22T18:47:18.436Z","updated_by":"elastic","created_at":"2022-05-22T18:44:31.207Z","created_by":"elastic","name":"Domain Controller Identified","tags":["osquery"],"interval":"1h","enabled":false,"description":"Host is an Active Directory Domain Controller","risk_score":47,"severity":"medium","building_block_type":"default","license":"","output_index":".siem-signals-default","meta":{"from":"15m","kibana_siem_app_url":"https://a2dc3df85d2f4037bd1915c4d607e288.us-west1.gcp.cloud.es.io:9243/app/security"},"timestamp_override":"@timestamp","author":["randomuserid"],"false_positives":[],"from":"now-4500s","rule_id":"5dda7921-f6f7-472f-b5b9-0e703b0dacbe","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":4,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["logs-*"],"query":"osquery.name: (DirectoryServices-DomainController or DNS-Server-Full-Role) or osquery.caption: (Active Directory Domain Controller or DNS Server)","filters":[],"throttle":"no_actions","actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0}
