{"id":"79780ab0-da03-11ec-962f-a3a018b7d10f","updated_at":"2022-05-22T19:18:48.341Z","updated_by":"elastic","created_at":"2022-05-22T19:14:59.938Z","created_by":"elastic","name":"DNS Server Identified","tags":["osquery"],"interval":"1h","enabled":false,"description":"Host is a DNS Server","risk_score":47,"severity":"medium","building_block_type":"default","license":"","output_index":".siem-signals-default","meta":{"from":"15m","kibana_siem_app_url":"https://a2dc3df85d2f4037bd1915c4d607e288.us-west1.gcp.cloud.es.io:9243/app/security"},"timestamp_override":"@timestamp","author":[],"false_positives":[],"from":"now-4500s","rule_id":"a76f07e0-6628-4fa5-b18b-532ab7d7f816","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":4,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["logs-*"],"query":"(osquery.name: \"DNS-Server-Full-Role\" or osquery.caption: \"DNS Server\") and osquery.statename: \"Enabled\" ","filters":[],"throttle":"no_actions","actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0}
